/**
 * @file 内部交易-配置文件
 * @author min.chen@joudou.com
 */

module.exports = {


    gradeText: ['高', '较高', '中', '低'],

    progressWidth: 130,


    typeText: {
        '0': '激励',
        '1': '激励',
        '2': '增持',
        '3': '回购',
        '4': '增持',
        '5': '员工持股',
        '6': '减持',
        '7': '减持'
    },

    actionText: {
        '0': '购买',
        '1': '购买',
        '2': '增持',
        '3': '回购',
        '4': '增持',
        '5': '购买',
        '6': '减持',
        '7': '减持'
    },

    priceText: {
        '0': '授予价',
        '1': '行权价',
        '2': '累计增持均价',
        '3': '累计回购均价',
        '4': '累计增持均价',
        '5': '累计购买均价',
        '6': '累计减持均价',
        '7': '累计减持均价'
    },

    priceTip: {
        '0': '将股票授予员工的价格，约为授予时市价的一半',
        '1': '一定期限内可购买股票的固定价格，约为授予时的市价'
    },

    priceCategory: {
        '1': '',
        '2': '估价',
        '3': '计划'
    },

    code: {
        '0': 'A/2',
        '1': 'A/2',
        '2': 'A*avg(B,C)/2',
        '3': 'A*avg(B,C)/2',
        '4': 'A*0.8/2',
        '5': 'A*avg(B,C)/2',
        '6': '',
        '7': ''
    },

    gradeFieldText: {
        price: '价格 （A）',
        amount: '金额 （B）',
        ratio: '占股比 （C）',
        peg: '增速 (A)'
    },

    gradeField: {
        '0': ['peg'],
        '1': ['peg'],
        '2': ['price', 'amount', 'ratio'],
        '3': ['price', 'amount', 'ratio'],
        '4': ['price'],
        '5': ['price', 'amount', 'ratio'],
        '6': '减持，不作评级',
        '7': '减持，不作评级'
    },


    gradeMoney1: ['大于2亿', '(1亿,2亿]', '(0.3亿,1亿]', '小于0.3亿'],
    gradeMoney2: ['大于5亿', '(2.5亿,5亿]', '(0.7亿,2.5亿]', '小于0.7亿'],

    gradeRatio1: ['大于1%', '(0.5%,1%]', '(0.3%,0.5%]', '小于0.3%'],
    gradeRatio2: ['大于5%', '(2.5%,5%]', '(0.7%,2.5%]', '小于0.7%'],

    gradePrice: ['(0,0.8]', '(0.8,1]', '(1,1.25]', '大于1.25'],

    gradePEG: ['(0,0.8]', '(0.8,1.3]', '(1.3,2.5]', '大于2.5'],


    lockType: {
        net_income: '净利润',
        revenue: '营业收入'
    }

}